Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 224, 224, 3)]     0         
_________________________________________________________________
dense (Dense)                (None, 224, 224, 100)     400       
_________________________________________________________________
dense_1 (Dense)              (None, 224, 224, 10)      1010      
=================================================================
Total params: 1,410
Trainable params: 1,410
Non-trainable params: 0
_________________________________________________________________
